### Maji Ndogo: From analysis to action
#### Weaving the data threads of Maji Ndogo's narrative

#####  Introduction
Subject: Results of audit on Maji Ndogo water project

Dear President Naledi,

I hope this email finds you in the best of health and spirits. As you know, my team and I were tasked with conducting an independent audit of the Maji Ndogo water project, specifically the database recording water sources in our country, following the inconsistencies identified by Chidi Kunto and his team.

For clarity, in this specific audit, our objective was to assess the integrity, and accuracy of the data stored in the database. Auditing a database involves verifying that the data it contains is both accurate and has not been tampered with, thereby ensuring that the information can be relied upon for decision-making and governance.

I am pleased to report that the audit is now complete. After a rigorous examination of the database's records, as well as the procedures in place for data entry and modification, we can confirm that the vast majority of the data aligns with the principles of good governance and data-driven decision-making that you have so vigorously championed.

However, we did find some data that was tampered with, which requires your immediate attention. I have attached the records I have re-examined for your review.

Thank you for entrusting us with this crucial task. Your commitment to accountability and transparency is truly commendable.

Sincerely,

Tendai Mubarak

Chief Auditor

Dear Tendai,

Thank you for the meticulous work you and your team have put into auditing the Maji Ndogo water project. The depth of your analysis reflects your commitment to excellence and accountability.

I am heartened to learn that our operations are largely in line with our principles of governance. At the same time, your findings are valuable as they highlight areas we can further improve.

Rest assured, I will be convening our data team to address any issues and take any steps necessary to ensure the integrity of our data.
Once again, I commend you and your team for your hard work and dedication. Maji Ndogo is indeed counting on all of us to deliver on our promises.

Thank you for playing your part.

All the best,

Aziza Naledi

### Connecting to MySQL Database

In [1]:
# Configure SQL Magic to display all query results without limiting the output
%config SqlMagic.displaylimit = None

In [2]:
# Load the SQL extension to enable SQL queries within the Jupyter notebook

%load_ext sql

displaylimit: Value None will be treated as 0 (no limit)

In [3]:
# Load the SQL extension for the notebook and connect to the MySQL database
%sql mysql+pymysql://root:salomeK2020!@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

### Creating an ERD

### Integrating the Auditor's Report

In [4]:
%%sql

DROP TABLE IF EXISTS `auditor_report`;
CREATE TABLE `auditor_report` (
  `location_id` VARCHAR(32),
  `type_of_water_source` VARCHAR(64),
  `true_water_source_score` INT DEFAULT NULL,
  `statements` VARCHAR(255)
);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

++
||
++
++

In [5]:
%%sql 
SHOW Tables

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|        auditor_report       |
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|      incorrect_records      |
|           location          |
|            visits           |
|        water_quality        |
|         water_source        |
|        well_pollution       |
+-----------------------------+

In [6]:
%%sql
SELECT
     *
FROM
    auditor_report

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-------------+----------------------+-------------------------+------------+
| location_id | type_of_water_source | true_water_source_score | statements |
+-------------+----------------------+-------------------------+------------+
+-------------+----------------------+-------------------------+------------+

Wow! First off, it looks like we have 1620 records, or sites that they re-visited. I see a location_id, type of water source at that location, and the
quality score of the water source, that is now independently measured. Our auditor also investigated each site a bit by speaking to a few locals.
Their statements are also captured in his results.

We need to tackle a couple of questions here.

1. Is there a difference in the scores?

2. If so, are there patterns?

For the first question, we will have to compare the quality scores in the water_quality table to the auditor's scores. The auditor_report table
used location_id, but the quality scores table only has a record_id we can use. The visits table links location_id and record_id, so we
can link the auditor_report table and water_quality using the visits table.


So first, grab the location_id and true_water_source_score columns from auditor_report.

In [7]:
%%sql
SELECT 
    location_id, 
    true_water_source_score
FROM
    auditor_report
LIMIT
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-------------+-------------------------+
| location_id | true_water_source_score |
+-------------+-------------------------+
+-------------+-------------------------+

Now, we join the visits table to the auditor_report table. Make sure to grab subjective_quality_score, record_id and location_id.

In [8]:
%%sql
SELECT
    A.location_id AS audit_location,
    A.true_water_source_score,
    V.location_id AS visit_location,
    V.record_id
FROM
    auditor_report AS A
JOIN
    visits AS V
ON
    A.location_id = V.location_id
LIMIT
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+----------------+-------------------------+----------------+-----------+
| audit_location | true_water_source_score | visit_location | record_id |
+----------------+-------------------------+----------------+-----------+
+----------------+-------------------------+----------------+-----------+

Now that we have the record_id for each location, our next step is to retrieve the corresponding scores from the water_quality table. We
are particularly interested in the subjective_quality_score. To do this, we'll JOIN the visits table and the water_quality table, using the
record_id as the connecting key.

In [9]:
%%sql
SELECT
    V.location_id AS audit_location,
    A.true_water_source_score,
    WAT_Q.record_id AS visit_location,
    V.record_id,
    WAT_Q.subjective_quality_score
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id
LIMIT
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+----------------+-------------------------+----------------+-----------+--------------------------+
| audit_location | true_water_source_score | visit_location | record_id | subjective_quality_score |
+----------------+-------------------------+----------------+-----------+--------------------------+
+----------------+-------------------------+----------------+-----------+--------------------------+

It doesn't matter if your columns are in a different format, because we are about to clean this up a bit. Since it is a duplicate, we can drop one of
the location_id columns. Let's leave record_id and rename the scores to surveyor_score and auditor_score to make it clear which scores
we're looking at in the results set.

In [10]:
%%sql
SELECT
    V.location_id AS audit_location,
    V.record_id,
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS surveyor_score
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id
LIMIT
    5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+----------------+-----------+---------------+----------------+
| audit_location | record_id | auditor_score | surveyor_score |
+----------------+-----------+---------------+----------------+
+----------------+-----------+---------------+----------------+

Since were joining 1620 rows of data, we want to keep track of the number of rows we get each time we run a query. We can either set the
maximum number of rows we want from "Limit to 1000 rows" to a larger number like 10000, or we can force SQL to give us all of the results, using
LIMIT 10000.

Ok, let's analyse! A good starting point is to check if the auditor's and exployees' scores agree. There are many ways to do it. We can have a
WHERE clause and check if surveyor_score = auditor_score, or we can subtract the two scores and check if the result is 0.

In [11]:
%%sql
SELECT
    V.location_id,
    V.record_id,                                          
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS employee_score,
    (true_water_source_score - subjective_quality_score) AS RESULT_SCORE
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id 
WHERE
    A.true_water_source_score = WAT_Q.subjective_quality_score 
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-------------+-----------+---------------+----------------+--------------+
| location_id | record_id | auditor_score | employee_score | RESULT_SCORE |
+-------------+-----------+---------------+----------------+--------------+
+-------------+-----------+---------------+----------------+--------------+

You got 2505 rows right? Some of the locations were visited multiple times, so these records are duplicated here. To fix it, we set visits.visit_count
= 1 in the WHERE clause. Make sure you reference the alias you used for visits in the join.

In [12]:
%%sql
SELECT
    V.location_id,
    V.record_id,                                          
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS employee_score,
    (true_water_source_score - subjective_quality_score) AS RESULT_SCORE
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id 
WHERE
    A.true_water_source_score = WAT_Q.subjective_quality_score 
AND
    V.visit_count=1
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-------------+-----------+---------------+----------------+--------------+
| location_id | record_id | auditor_score | employee_score | RESULT_SCORE |
+-------------+-----------+---------------+----------------+--------------+
+-------------+-----------+---------------+----------------+--------------+

With the duplicates removed I now get 1518. What does this mean considering the auditor visited 1620 sites?

I think that is an excellent result. 1518/1620 = 94% of the records the auditor checked were correct!!

But that means that 102 records are incorrect. So let's look at those. You can do it by adding one character in the last query!

In [13]:
%%sql
SELECT
    V.location_id,
    V.record_id,                                          
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS employee_score
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id 
WHERE
    A.true_water_source_score <> WAT_Q.subjective_quality_score 
AND
    V.visit_count=1
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-------------+-----------+---------------+----------------+
| location_id | record_id | auditor_score | employee_score |
+-------------+-----------+---------------+----------------+
+-------------+-----------+---------------+----------------+

Since we used some of this data in our previous analyses, we need to make sure those results are still valid, now we know some of them are
incorrect. We didn't use the scores that much, but we relied a lot on the type_of_water_source, so let's check if there are any errors there.

So, to do this, we need to grab the type_of_water_source column from the water_source table and call it survey_source, using the
source_id column to JOIN. Also select the type_of_water_source from the auditor_report table, and call it auditor_source.

In [14]:
%%sql
SELECT
    V.location_id,
    W.type_of_water_source AS survey_source,
    A.type_of_water_source as auditor_source,
    V.record_id,                                          
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS surveyor_score
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    water_source AS W
ON
    W.source_id = V.source_id
WHERE
    A.true_water_source_score <> WAT_Q.subjective_quality_score 
AND
    V.visit_count=1
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-------------+---------------+----------------+-----------+---------------+----------------+
| location_id | survey_source | auditor_source | record_id | auditor_score | surveyor_score |
+-------------+---------------+----------------+-----------+---------------+----------------+
+-------------+---------------+----------------+-----------+---------------+----------------+

So what I can see is that the types of sources look the same! So even though the scores are wrong, the integrity of the type_of_water_source
data we analysed last time is not affected.

### Linking Records to Employees

Next up, let's look at where these errors may have come from. At some of the locations, employees assigned scores incorrectly, and those records
ended up in this results set.

I think there are two reasons this can happen.

1. These workers are all humans and make mistakes so this is expected.
2. Unfortunately, the alternative is that someone assigned scores incorrectly on purpose!

In either case, the employees are the source of the errors, so let's JOIN the assigned_employee_id for all the people on our list from the visits
table to our query. Remember, our query shows the shows the 102 incorrect records, so when we join the employee data, we can see which
employees made these incorrect records.

In [15]:
%%sql
SELECT
    V.location_id,
    V.record_id, 
    V.assigned_employee_id,
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS surveyor_score
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id 

WHERE
    A.true_water_source_score <> WAT_Q.subjective_quality_score 
AND
    V.visit_count=1
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-------------+-----------+----------------------+---------------+----------------+
| location_id | record_id | assigned_employee_id | auditor_score | surveyor_score |
+-------------+-----------+----------------------+---------------+----------------+
+-------------+-----------+----------------------+---------------+----------------+

So now we can link the incorrect records to the employees who recorded them. The ID's don't help us to identify them. We have employees' names
stored along with their IDs, so let's fetch their names from the employees table instead of the ID's.

In [16]:
%%sql
SELECT *
FROM
    visits
LIMIT 5

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
|     2     |  HaRu19752  | HaRu19752224 | 2021-01-01 09:36:00 |      1      |       62      |          40          |
|     3     |  AkLu01628  | AkLu01628224 | 2021-01-01 09:53:00 |      1      |       0       |          1           |
|     4     |  AkRu03357  | AkRu03357224 | 2021-01-01 10:11:00 |      1      |       28      |          14          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

In [17]:
%%sql
SELECT
    V.location_id,
    V.record_id, 
    E.employee_name,
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS surveyor_score
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    employee AS E
ON
      V.assigned_employee_id = E.assigned_employee_id

WHERE
    A.true_water_source_score <> WAT_Q.subjective_quality_score 
AND
    V.visit_count=1
LIMIT 10000

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-------------+-----------+---------------+---------------+----------------+
| location_id | record_id | employee_name | auditor_score | surveyor_score |
+-------------+-----------+---------------+---------------+----------------+
+-------------+-----------+---------------+---------------+----------------+

Well this query is massive and complex, so maybe it is a good idea to save this as a CTE, so when we do more analysis, we can just call that CTE
like it was a table. Call it something like Incorrect_records. Once you are done, check if this query SELECT * FROM Incorrect_records, gets
the same table back.

In [18]:
%%sql
WITH Incorrect_records AS (
SELECT
    V.location_id,
    V.record_id, 
    E.employee_name,
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS surveyor_score
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    employee AS E
ON
      V.assigned_employee_id = E.assigned_employee_id

WHERE
    A.true_water_source_score <> WAT_Q.subjective_quality_score 
AND
    V.visit_count=1)
SELECT
      *
FROM
    Incorrect_records
LIMIT 10000

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-------------+-----------+---------------+---------------+----------------+
| location_id | record_id | employee_name | auditor_score | surveyor_score |
+-------------+-----------+---------------+---------------+----------------+
+-------------+-----------+---------------+---------------+----------------+

Now that we defined Incorrect_records, we can query it like any other table.

Let's first get a unique list of employees from this table. Think back to the start of your SQL journey to answer this one. I got 17 employees.

In [19]:
%%sql
WITH Incorrect_records AS (
SELECT
    V.location_id,
    V.record_id, 
    E.employee_name,
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS surveyor_score
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    employee AS E
ON
      V.assigned_employee_id = E.assigned_employee_id

WHERE
    A.true_water_source_score <> WAT_Q.subjective_quality_score 
AND
    V.visit_count=1)
SELECT
      DISTINCT employee_name
FROM
    Incorrect_records
LIMIT 10000

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+---------------+
| employee_name |
+---------------+
+---------------+

Next, let's try to calculate how many mistakes each employee made. So basically we want to count how many times their name is in
Incorrect_records list, and then group them by name, right?

In [20]:
%%sql
WITH Incorrect_records AS (
SELECT
    V.location_id,
    V.record_id, 
    E.employee_name,
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS surveyor_score
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    employee AS E
ON
      V.assigned_employee_id = E.assigned_employee_id

WHERE
    A.true_water_source_score <> WAT_Q.subjective_quality_score 
AND
    V.visit_count=1)
SELECT
    DISTINCT employee_name,
    count(employee_name) OVER (PARTITION BY employee_name) AS number_of_mistakes 
FROM
    Incorrect_records
ORDER BY number_of_mistakes DESC
LIMIT 10000

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+---------------+--------------------+
| employee_name | number_of_mistakes |
+---------------+--------------------+
+---------------+--------------------+

It looks like some of our surveyors are making a lot of "mistakes" while many of the other surveyors are only making a few. I don't like where this is
going!

### Gathering Some Evidence

Ok, so thinking about this a bit. How would we go about finding out if any of our employees are corrupt?

Let's say all employees make mistakes, if someone is corrupt, they will be making a lot of "mistakes", more than average, for example. But someone
could just be clumsy, so we should try to get more evidence...

Our auditor did say some of the things he heard on the streets were quite shady, and he recorded this in the statements column. Considering
both of these sources should give us a pretty reliable answer.

So let's try to find all of the employees who have an above-average number of mistakes. Let's break it down into steps first:
1. We have to first calculate the number of times someone's name comes up. (we just did that in the previous query). Let's call it error_count.
2. Then, we need to calculate the average number of mistakes employees made. We can do that by taking the average of the previous query's
results. Something like this:
SELECT
AVG(number_of_mistakes)
FROM
error_count;
Let's call that result avg_error_count_per_empl, which would be a scalar value.
3. Finaly we have to compare each employee's error_count with avg_error_count_per_empl. We will call this results set our suspect_list.
Remember that we can't use an aggregate result in WHERE, so we have to use avg_error_count_per_empl as a subquery.
SELECT
employee_name,
number_of_mistakes
FROM
error_count
WHERE
number_of_mistakes > (avg_error_count_per_empl);

1. Let's start by cleaning up our code a bit. First, Incorrect_records is a result we'll be using for the rest of the analysis, but it makes the
query a bit less readable. So, let's convert it to a VIEW. We can then use it as if it was a table. It will make our code much simpler to read, but, it
comes at a cost. We can add comments to CTEs in our code, so if we return to that query a year later, we can read those comments and quickly
understand what Incorrect_records represents. If we save it as a VIEW, it is not as obvious. So we should add comments in places where we
use Incorrect_records.

In [21]:
%%sql
CREATE VIEW Incorrect_records AS (
SELECT
    V.location_id,
    V.record_id, 
    E.employee_name,
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS surveyor_score,
    A.statements AS statements
FROM
    visits AS V
JOIN 
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
    auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    employee AS E
ON
      V.assigned_employee_id = E.assigned_employee_id

WHERE
    A.true_water_source_score <> WAT_Q.subjective_quality_score 
AND
    V.visit_count=1)
SELECT 
    * 
FROM 
    Incorrect_records
LIMIT 10000

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

RuntimeError: If using snippets, you may pass the --with argument explicitly.
For more details please refer: https://jupysql.ploomber.io/en/latest/compose.html#with-argument


Original error message from DB driver:
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'SELECT\n    *\nFROM\n    Incorrect_records\nLIMIT 10000' at line 28")
[SQL: CREATE VIEW Incorrect_records AS (
SELECT
    V.location_id,
    V.record_id,
    E.employee_name,
    A.true_water_source_score AS auditor_score,
    WAT_Q.subjective_quality_score AS surveyor_score,
    A.statements AS statements
FROM
    visits AS V
JOIN
   water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN
    auditor_report AS A
ON
    V.location_id = A.location_id
JOIN
    employee AS E
ON
      V.assigned_employee_id = E.assigned_employee_id

WHERE
    A.true_water_source_score <> WAT_Q.subjective_quality_score
AND
    V.visit_count=1)
SELECT
    *
FROM
    Incorrect_records
LIMIT 10000]
(Background on this error at: https://sqlalche.me/e/14/f405)

If you need help solving this issue, send us a message: https://ploomber.io/community

Next, we convert the query error_count, we made earlier, into a CTE. Test it to make sure it gives the same result again, using SELECT * FROM
Incorrect_records. On large queries like this, it is better to build the query, and test each step, because fixing errors becomes harder as the
query grows.
Like this:

In [ ]:
%%sql
WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
SELECT
employee_name,
COUNT(employee_name) AS number_of_mistakes
FROM
Incorrect_records
##Incorrect_records is a view that joins the audit report to the database
##for records where the auditor and
##employees scores are different*

GROUP BY
employee_name)
SELECT
    * 
FROM 
    error_count;

2. Now calculate the average of the number_of_mistakes in error_count. You should get a single value.

In [ ]:
%%sql
WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
SELECT
employee_name,
COUNT(employee_name) AS number_of_mistakes
FROM
Incorrect_records
##Incorrect_records is a view that joins the audit report to the database
##for records where the auditor and
##employees scores are different*

GROUP BY
employee_name)
SELECT
    AVG (number_of_mistakes) AS AVG_mistakes
FROM 
    error_count;

3. To find the employees who made more mistakes than the average person, we need the employee's names, the number of mistakes each one
made, and filter the employees with an above-average number of mistakes.
HINT: Use SELECT AVG(mistake_count) FROM error_count as a custom filter in the WHERE part of our query.

In [ ]:
%%sql
WITH error_count AS ( 
SELECT
    employee_name,
    COUNT(employee_name) AS number_of_mistakes
FROM
    Incorrect_records
GROUP BY
    employee_name)

SELECT
     employee_name,
     number_of_mistakes
FROM 
   error_count
WHERE
    number_of_mistakes > 6

GROUP BY
    employee_name
ORDER BY
    number_of_mistakes DESC;

You should get a column of names back. So let's just recap here...
1. We use Incorrect_records to find all of the records where the auditor and employee scores don't match.
2. We then used error_count to aggregate the data, and got the number of mistakes each employee made.
3. Finally, suspect_list retrieves the data of employees who make an above-average number of mistakes.

Now we can filter that Incorrect_records view to identify all of the records associated with the four employees we identified.

Firstly, let's add the statements column to the Incorrect_records view. Then pull up all of the records where the employee_name is in the
suspect list. 

HINT: Use SELECT employee_name FROM suspect_list as a subquery in WHERE.

In [ ]:
%%sql
WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
SELECT
    employee_name,
    COUNT(employee_name) AS number_of_mistakes
FROM
    Incorrect_records

#Incorrect_records is a view that joins the audit report to the database for records where the auditor and employees scores are different*

GROUP BY
    employee_name),
suspect_list AS (-- This CTE SELECTS the employees with aboveaverage mistakes
SELECT
    employee_name,
    number_of_mistakes
FROM
    error_count
WHERE
    number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count))
# This query filters all of the records where the "corrupt" employees gathered data.
SELECT
    employee_name,
    location_id,
    statements
FROM
    Incorrect_records
WHERE
    employee_name in (SELECT employee_name FROM suspect_list)
limit 10000;

### Integrated project: Maji Ndogo part 3 [MCQ]

1. The following query results in 2,698 rows of data being retrieved, but the auditor_report table only has 1,620 rows. Analyse the query and select the reason why this discrepancy occurs. Hint: Think about the type of relationship between our tables.

In [ ]:
%%sql
SELECT
    auditorRep.location_id,
    visitsTbl.record_id,
    Empl_Table.employee_name,
    auditorRep.true_water_source_score AS auditor_score,
    wq.subjective_quality_score AS employee_score
FROM auditor_report AS auditorRep
JOIN visits AS visitsTbl
ON auditorRep.location_id = visitsTbl.location_id
JOIN water_quality AS wq
ON visitsTbl.record_id = wq.record_id
JOIN employee as Empl_Table
ON Empl_Table.assigned_employee_id = visitsTbl.assigned_employee_id

Ans:The visits table has multiple records for each location_id, which when joined with auditor_report, results in multiple records for each location_id.

2. What is the function of Incorrect_records in the following query?